{

  "site" : {
    "author" : "Владимир Шелест",
    "name" : "Личный сайт веб разработчика",
    "date" : "2017",
    "motto": "Создано с любовью в Loftshcool",
    "footerMessage": "Я веб-разработчик из Сумской области Украины, и этот сайт сделал в рамках обучения в Школе онлайн образования LoftSchool",
    "pages": {
      "index" : "Приветствую",
      "works" : "Мои работы",
      "about" : "Обо мне",
      "blog" : "Блог"
    }
  },

  "contacts": [
    {
      "name": "skype",
      "value": "vvshelest"
    },
    {
      "name": "email",
      "value": "freeelk@gmail.com"
    },
    {
      "name": "phone",
      "value": "+3080955888***"
    },
    {
      "name": "address",
      "value": "Украина, Сумская область, г. Тростянец"
    }
  ],

  "socials" : [
    {
      "name": "vk",
      "link" : "https://vk.com/id245558002"
    },
    {
      "name": "github",
      "link": "https://github.com/freeelk"
    },
    {
      "name": "in",
      "link": "https://www.linkedin.com/in/volodymyr-shelest-5a3758b1/"
    }
  ],

  "greetMenu" : [
    {
      "label": "Мои работы",
      "link": "works.html"
    },
    {
      "label": "Обо мне",
      "link": "about.html"
    },
    {
      "label": "Блог",
      "link": "blog.html"
    }
  ],

  "footerMenu" : [
    {
      "label": "Мои работы",
      "link": "works.html"
    },
    {
      "label": "Обо мне",
      "link": "about.html"
    },
    {
      "label": "Блог",
      "link": "blog.html"
    },
    {
      "label": "Авторизация",
      "link": "index.html"
    }
  ],

  "aboutText": "<p>Я веб-разработчик из Сумской области Украины. Мне 47 лет. Я занимаюсь программированием на PHP. Использую фреймфорк Yii.</p><p>Также я работаю с javaScript и jQuery. Имею некоторые знания по Angular.js<p/><p>На курсе по продвинутой web-разработке я расширял свои знания и навыки в верстке сайтов</p>",

  "usefull" : {
    "text" : "Больше всего меня привлекает работа с данными и программирование. Но я могу решать и задачи по верстке. Но давайте по порядку",
    "areas" : [
      {
        "name": "Frontend",
        "skills" : [
          {
            "name": "HTML",
            "progress": "50"
          },
          {
            "name": "CSS3",
            "progress": "50"
          },
          {
            "name": "JavaScript & jQuery",
            "progress": "50"
          }
        ]
      },
      {
        "name": "Backend",
        "skills" : [
          {
            "name": "PHP",
            "progress": "50"
          },
          {
            "name": "mySQL",
            "progress": "50"
          },
          {
            "name": "Node.js & npm",
            "progress": "50"
          },
          {
            "name": "Mongo db",
            "progress": "50"
          }
        ]
      },
      {
        "name": "Workflow",
        "skills" : [
          {
            "name": "Git",
            "progress": "50"
          },
          {
            "name": "Gulp",
            "progress": "50"
          },
          {
            "name": "Bower",
            "progress": "50"
          }
        ]
      }
    ]
  },


  "feedbacks": [
    {
      "content": "Этот парень проходил обучение. 2 месяца тяжелых испытаний и бессонных ночей",
      "author": "Ковальчук Дмитрий",
      "about": "основатель Loftshcool",
      "photo": "dima.jpg"
    },
    {
      "content": "Еще один отзыв. Этот парень проходил обучение. 2 месяца тяжелых испытаний и бессонных ночей",
      "author": "Зар Захаров",
      "about": "преподаватель",
      "photo": "zar.jpg"
    }
  ],

  "blog": [
    {
      "title": "Технические подробности об Andromeda — новой универсальной ОС от Google",
      "date": "15 февраля 2017",
      "content": "<p>Google совершенно не пытается скрыть какие-либо детали о проекте: в текущей стадии он называется Fuchsia, и мы уже подробно рассказывали о нем в одной из наших предыдущих статей, скомпилировав и запустив его исходный код. Ядро операционной системы (вернее, микроядро) называется Magenta. Да, Andromeda не использует ядро Linux. Одна из основных черт новой ОС — масштабируемость.</p> <p>Ошибочно предполагать, что Fuchsia — это проект, в рамках которого Chrome OS вливается в Android. Правильнее считать, что Android и Chrome OS сливаются вместе и становятся частью Fuchsia. Кстати, процесс слияния Android и Chrome OS уже идет некоторое время: команды Chrome и Android работали вместе для того, чтобы добавить специальную систему обновлений в Android Nougat — это позволило производить обновления платформы для проведения A/B тестирования.</p>",
      "selected": true
    },
    {
      "title": "Google предоставила пользователям доступ к системе управления базами данных, которая используется в самой компании",
      "date": "16 февраля 2017",
      "content": "<p>Вчера Google объявила о запуске Cloud Spanner — системы управления базами данных, которая может быть использована через платформу Google Cloud.</h><h>Данный сервис Google использовала внутри компании в течение многих лет. Подобное произошло и с сервисом Google Cloud Bigtable. Она выпустила его лишь после 9 лет внутреннего использования.</p>"
    },
    {
      "title": "Самый странный коммит в истории ядра Linux",
      "date": "16 февраля 2017",
      "content": "<p>Git также поддерживает слияния типа «осьминог», у которых есть больше двух родителей. Это непривычно для тех, кто работает над маленькими проектами: ну неужели вас не смутит слияние трёх или четырёх родителей? Однако такое случается. Иногда люди, сопровождающие ядро, объединяют десятки отдельных историй. 30 отдельных слияний проводить куда неудобнее, чем одно с 30 родителями, особенно если оно пройдёт без конфликтов.</p>"
    },
    {
      "title": "17 нововведений jQuery 3 и советы по их использованию",
      "date": "5 февраля 2017",
      "content": "<p>Прошло уже более 10 лет с того момента, как библиотека jQuery начала своё широкое распространение по Интернету, и она до сих пор пользуется большой популярностью. В июле 2015 года jQuery анонсировала альфа-версию 3.0 — крупнейшее обновление за долгие годы.</p><p>Текущая версия 3.1.1, вышедшая в сентябре 2016 года, исправила множество багов, добавила новые методы и удалила избыточные, также изменив поведение некоторых функций. Давайте разберемся в нововведениях, которые были представлены в этой версии.</p>"
    }

  ]
}